#+TITLE: Intro To Comp Thinking Week 7 Tutorial
#+AUTHOR: Hankertrix
#+STARTUP: showeverything
#+OPTIONS: toc:2

** (ii)
#+begin_src python :results output
print([(n*n) for n in range(13) if n % 2 == 0])
#+end_src

#+RESULTS:
: [0, 4, 16, 36, 64, 100, 144]


** (i)
#+begin_src python :results output
list1 = [1, 2, 99]
list2 = list1
list3 = list2
list1 = list1.remove(1)
print(list1, list2, list3)
#+end_src

#+RESULTS:
: None [2, 99] [2, 99]

Explanation:
- The variable ~list2~ contains a reference to ~list1~.
- This means that any changes to the ~list1~ will affect ~list2~, since ~list2~ just returns ~list1~.
- Similarly, the variable ~list3~ just contains a reference to ~list2~, which is just a reference to ~list1~.
- Thus, ~list3~ and ~list2~ all just point back to ~list1~, so when ~list1~ is modified, both ~list2~ and ~list3~ are changed.
- As a result, when ~1~ is removed from ~list1~, ~list2~ and ~list3~ will also have ~1~ removed from them, as ~list1~, ~list2~ and ~list3~ are all references to the same list.
- ~list.remove()~ is a function that modifies a list in place and does not return any value, which is ~None~ in Python.
- So, assigning ~list1~ to the result of ~list1.remove(1)~ is basically assigning ~list1~ to ~None~.


** (ii)
#+begin_src python :results output
list1 = [1, 2, 99]
list2 = list1
list3 = list1[:]
list1.remove(1)
print(list1, list2, list3)
#+end_src

#+RESULTS:
: [2, 99] [2, 99] [1, 2, 99]


*** (a)
#+begin_src python :results output
L1 = L2 = []
L1.append(1)
L2.append(2)
print(L1)
print(L2)
#+end_src

#+RESULTS:
: [1, 2]
: [1, 2]

*** (b)
#+begin_src python :results output
L1, L2 = [], []
L1.append(1)
L2.append(2)
print(L1)
print(L2)
#+end_src

#+RESULTS:
: [1]
: [2]


* Question 7
#+begin_src python :results output
langs = ["Python", "C++", "Fortran", "Algol", "Java"]
print(langs)
del langs[1]
print(langs)
del langs[:]
print(langs)
#+end_src

#+RESULTS:
: ['Python', 'C++', 'Fortran', 'Algol', 'Java']
: ['Python', 'Fortran', 'Algol', 'Java']
: []


* Question 9
#+begin_src python :results output

# The dictionary of months
month_dict = {
    1: "January",
    2: "February",
    3: "March",
    4: "April",
    5: "May",
    6: "June",
    7: "July",
    8: "August",
    9: "September",
    10: "October",
    11: "November",
    12: "December",
}

# The list of strings to print
str_list: list[str] = []

# Iterates over the keys of the dictionary
for month_num in month_dict:
    str_list.append(month_dict[month_num])

# Prints the string list
print("\n".join(str_list))
#+end_src

#+RESULTS:
#+begin_example
January
February
March
April
May
June
July
August
September
October
November
December
#+end_example


